---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes
source: html/3f1b13ff-0488-0a46-b646-21c2e29398e7.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes

A collection of ids of the ExternalResourceTypes provided by Revit.

## Syntax (C#)
```csharp
public static class BuiltInExternalResourceTypes
```